#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.http.myip: Reading...
data.http.myip: Read complete after 0s [id=http://ipv4.icanhazip.com]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNWRhODZjNy00YjViLTQ0OGYtOGZkNC0wOGU5YzdhMjE3MmY7b2JqZWN0SWQ9OTkwNTNlMDgtODdiNi00NTg1LWI3N2QtZTlkMjA3MjU1MWViO3N1YnNjcmlwdGlvbklkPWRjZDg4ODU1LTcwZGYtNDlhMC05ZjE1LWE5MTk0MWJiYTAzNDt0ZW5hbnRJZD03ZjhjYWZjOC00MzE0LTQwNzAtOTc0NC1mZTAyZjkxYmNiMjE=]
module.keyvault.azurerm_key_vault.keyvalue: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.KeyVault/vaults/kv-polinetwork]
module.aks.azurerm_kubernetes_cluster.k8s: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork]
data.azurerm_key_vault_secret.prod_bot_mat_db_password: Reading...
data.azurerm_key_vault_secret.dev_db_host: Reading...
data.azurerm_key_vault_secret.dev_db_password: Reading...
data.azurerm_key_vault_secret.dev_mod_bot_token: Reading...
data.azurerm_key_vault_secret.prod_mod_db_user: Reading...
data.azurerm_key_vault_secret.admin_db_password: Reading...
data.azurerm_key_vault_secret.prod_db_password: Reading...
data.azurerm_key_vault_secret.dev_db_user: Reading...
data.azurerm_key_vault_secret.dev_mat_config_password: Reading...
data.azurerm_key_vault_secret.dev_mod_bot_token: Read complete after 1s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-mod-bot-token/1b37830ceb1f4ef19d844d751bbbdcea]
data.azurerm_key_vault_secret.prod_bot_mat_db_user: Reading...
data.azurerm_key_vault_secret.prod_bot_mat_token: Reading...
data.azurerm_key_vault_secret.dev_db_host: Read complete after 1s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-host/6ddefea6cdb34afc8e9f38c1e5582cf1]
data.azurerm_key_vault_secret.prod_mod_bot_token: Reading...
data.azurerm_key_vault_secret.dev_db_password: Read complete after 2s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-password/d3136bf3111241c584924ad83e1bd5ff]
module.argo-cd.helm_release.argo_cd: Refreshing state... [id=argo]
data.azurerm_key_vault_secret.prod_bot_mat_db_password: Read complete after 2s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-db-password/082663ce438f414aa85455703a5e3b6e]
module.argo-cd.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
data.azurerm_key_vault_secret.dev_db_user: Read complete after 3s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-user/fd6f78a35a91432aa18556407be83644]
data.azurerm_key_vault_secret.admin_db_password: Read complete after 3s [id=https://kv-polinetwork.vault.azure.net/secrets/admin-db-password/33d587ac42324bb6bda55b7db228da4b]
module.argo-cd.helm_release.argocd_apps: Refreshing state... [id=argocd-apps]
data.azurerm_key_vault_secret.prod_db_password: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-db-password/5e8e79f481ce479a95c39578bf25c469]
data.azurerm_key_vault_secret.prod_mod_db_user: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mod-db-user/75dc80fca95f46d3a05e820ecbefe406]
module.mariadb.kubernetes_secret.mariadb_admin: Refreshing state... [id=mariadb/mariadb-secret]
module.mariadb.azurerm_managed_disk.storage: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.Compute/disks/md-polinetwork]
module.mariadb.kubernetes_namespace.mariadb: Refreshing state... [id=mariadb]
module.mariadb.kubernetes_service.mariadb_service: Refreshing state... [id=mariadb/mariadb]
data.azurerm_key_vault_secret.dev_mat_config_password: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-mat-config-password/1cdf8fcef56c4492b8879ec7c0744cc0]
module.mariadb.kubernetes_persistent_volume.storageaks: Refreshing state... [id=mariadb-persistent-volume]
module.mariadb.kubernetes_persistent_volume_claim.mariadb_storage: Refreshing state... [id=mariadb/mariadb-storage-claim]
data.azurerm_key_vault_secret.prod_bot_mat_db_user: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-db-user/1a576db34de34238bdfc1e4a629c6d7a]
module.mariadb.kubernetes_secret.initdb: Refreshing state... [id=mariadb/initdb]
module.bot_mod_prod.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-prod]
module.bot_mod_dev.random_uuid.volume: Refreshing state... [id=82d874fc-ddcf-7b10-d817-0a0a48e99713]
module.bot_mat_prod.random_uuid.volume: Refreshing state... [id=ff0f262a-01ef-62f6-af47-3a38a72bfdf1]
module.bot_mod_prod.random_uuid.volume: Refreshing state... [id=bdf6cceb-12b3-41c2-0c11-241080e928d0]
module.bot_mod_dev.kubernetes_secret.bot_secret: Refreshing state... [id=bot-dev/bot-config-secret]
module.bot_mod_dev.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-dev]
module.bot_mat_prod.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-mat]
module.bot_mat_prod.azurerm_managed_disk.storage[0]: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.Compute/disks/md-polinetwork-ff0f262a-01ef-62f6-af47-3a38a72bfdf1]
data.azurerm_key_vault_secret.prod_bot_mat_token: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-token/3303faadab4448e0a689eb431d0062dd]
module.bot_mat_prod.kubernetes_secret.bot_secret: Refreshing state... [id=bot-mat/bot-config-secret]
module.bot_mat_prod.kubernetes_persistent_volume.storage[0]: Refreshing state... [id=ff0f262a-01ef-62f6-af47-3a38a72bfdf1-bot-pv]
module.bot_mat_prod.kubernetes_persistent_volume_claim.storage_pvc[0]: Refreshing state... [id=bot-mat/bot-pvc]
data.azurerm_key_vault_secret.prod_mod_bot_token: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mod-bot-token/5aef155b159b492891f3b17948073324]
module.bot_mod_prod.kubernetes_secret.bot_secret: Refreshing state... [id=bot-prod/bot-config-secret]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bot_mat_prod.kubernetes_secret.material_config[0] will be created
  + resource "kubernetes_secret" "material_config" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "materialbot-config"
          + namespace        = "bot-mat"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Eliaxie, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*